<?php

declare(strict_types=1);

use VPremiss\Arabicable\Facades\ArabicFilter;
use VPremiss\Crafty\Facades\CraftyPackage;

it('can format the Arabic text into a suitable one with harakat', function () {
    CraftyPackage::setConfiguration('arabicable.spacing_after_punctuation_only', false);

    $arabic = <<<Arabic
٢٥١٦ - حَدَّثَنَا ‌أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، قَالَ: أَخْبَرَنَا ‌عَبْدُ اللهِ بْنُ الْمُبَارَكِ، قَالَ: أَخْبَرَنَا ‌لَيْثُ بْنُ سَعْدٍ ‌وَابْنُ لَهِيعَةَ ، عَنْ ‌قَيْسِ بْنِ الْحَجَّاجِ. (ح) وَحَدَّثَنَا ‌عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ: أَخْبَرَنَا ‌أَبُو الْوَلِيدِ، قَالَ: حَدَّثَنَا

⦗٢٨٥⦘

‌لَيْثُ بْنُ سَعْدٍ، قَالَ: حَدَّثَنِي ‌قَيْسُ بْنُ الْحَجَّاجِ، الْمَعْنَى وَاحِدٌ عَنْ ‌حَنَشٍ الصَّنْعَانِيِّ ، عَنِ ‌ابْنِ عَبَّاسٍ قَالَ: «كُنْتُ خَلْفَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا، فَقَالَ: يَا غُلَامُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ؛ احْفَظِ اللهَ يَحْفَظْكَ،» احْفَظِ اللهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ، لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ لَكَ، وَلَوِ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ عَلَيْكَ، رُفِعَتِ الْأَقْلَامُ وَجَفَّتِ الصُّحُفُ.
Arabic;

    $expectedText = <<<Arabic
٢٥١٦ - حَدَّثَنَا ‌أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى ، قَالَ : أَخْبَرَنَا ‌عَبْدُ اللهِ بْنُ الْمُبَارَكِ ، قَالَ : أَخْبَرَنَا ‌لَيْثُ بْنُ سَعْدٍ ‌وَابْنُ لَهِيعَةَ ، عَنْ ‌قَيْسِ بْنِ الْحَجَّاجِ . (ح) وَحَدَّثَنَا ‌عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ ، قَالَ : أَخْبَرَنَا ‌أَبُو الْوَلِيدِ ، قَالَ : حَدَّثَنَا ⦗٢٨٥⦘ ‌لَيْثُ بْنُ سَعْدٍ ، قَالَ : حَدَّثَنِي ‌قَيْسُ بْنُ الْحَجَّاجِ ، الْمَعْنَى وَاحِدٌ عَنْ ‌حَنَشٍ الصَّنْعَانِيِّ ، عَنِ ‌ابْنِ عَبَّاسٍ قَالَ : «كُنْتُ خَلْفَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا ، فَقَالَ : يَا غُلَامُ ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ ؛ احْفَظِ اللهَ يَحْفَظْكَ ،» احْفَظِ اللهَ تَجِدْهُ تُجَاهَكَ ، إِذَا سَأَلْتَ فَاسْأَلِ اللهَ ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ ، لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ لَكَ ، وَلَوِ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ عَلَيْكَ ، رُفِعَتِ الْأَقْلَامُ وَجَفَّتِ الصُّحُفُ .
Arabic;

    $text = ArabicFilter::withHarakat($arabic);

    expect(substr($text, 0, -1))->toBe($expectedText);

    // TODO test the configuration diff somewhere else and always test without it everywhere else!
    CraftyPackage::setConfiguration('arabicable.spacing_after_punctuation_only', true);

    $expectedText = <<<Arabic
٢٥١٦ - حَدَّثَنَا ‌أَحْمَدُ بْنُ مُحَمَّدِ بْنِ مُوسَى، قَالَ: أَخْبَرَنَا ‌عَبْدُ اللهِ بْنُ الْمُبَارَكِ، قَالَ: أَخْبَرَنَا ‌لَيْثُ بْنُ سَعْدٍ ‌وَابْنُ لَهِيعَةَ، عَنْ ‌قَيْسِ بْنِ الْحَجَّاجِ. (ح) وَحَدَّثَنَا ‌عَبْدُ اللهِ بْنُ عَبْدِ الرَّحْمَنِ، قَالَ: أَخْبَرَنَا ‌أَبُو الْوَلِيدِ، قَالَ: حَدَّثَنَا ⦗٢٨٥⦘ ‌لَيْثُ بْنُ سَعْدٍ، قَالَ: حَدَّثَنِي ‌قَيْسُ بْنُ الْحَجَّاجِ، الْمَعْنَى وَاحِدٌ عَنْ ‌حَنَشٍ الصَّنْعَانِيِّ، عَنِ ‌ابْنِ عَبَّاسٍ قَالَ: «كُنْتُ خَلْفَ رَسُولِ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَوْمًا، فَقَالَ: يَا غُلَامُ، إِنِّي أُعَلِّمُكَ كَلِمَاتٍ؛ احْفَظِ اللهَ يَحْفَظْكَ،» احْفَظِ اللهَ تَجِدْهُ تُجَاهَكَ، إِذَا سَأَلْتَ فَاسْأَلِ اللهَ، وَإِذَا اسْتَعَنْتَ فَاسْتَعِنْ بِاللهِ، وَاعْلَمْ أَنَّ الْأُمَّةَ لَوِ اجْتَمَعَتْ عَلَى أَنْ يَنْفَعُوكَ بِشَيْءٍ، لَمْ يَنْفَعُوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ لَكَ، وَلَوِ اجْتَمَعُوا عَلَى أَنْ يَضُرُّوكَ بِشَيْءٍ لَمْ يَضُرُّوكَ إِلَّا بِشَيْءٍ قَدْ كَتَبَهُ اللهُ عَلَيْكَ، رُفِعَتِ الْأَقْلَامُ وَجَفَّتِ الصُّحُفُ.
Arabic;

    $text = ArabicFilter::withHarakat($arabic);

    expect(substr($text, 0, -1))->toBe($expectedText);
});



it('can format the Arabic text into a suitable one without harakat', function () {
    CraftyPackage::setConfiguration('arabicable.spacing_after_punctuation_only', false);

    $arabic = <<<Arabic
٨٨٩٢- حَدَّثنا أحمد بن إسحاق، قَال: حَدَّثنا خلاد بن يحيى، قَال: حَدَّثنا هِشَامُ بْنُ سَعْد، عَن زَيد بْنِ أَسْلَمَ، عَن أبي صالح، عَن أبي هُرَيرة، قَالَ: قَالَ رَسُول اللهِ صَلَّى اللَّهُ عَلَيه وَسَلَّم: لما خلق الله آدم مسح ظهره فسقط من ظهره كل نسمة هو خالقها إلى يوم القيامة، ثُمَّ جعل عُمُر لكل إنسان منهم فقال آدم: من هؤلاء؟ ، أَحسَبُهُ قال: بنوك قال، وإذا رجل منهم له نور بين عينيه فقال آدم: من هذا؟ قال: هذا رجل من ذريتك فى آخر الأمم يقال له داود قال: وكم جعلت عمره؟ قال: ستون سنة قال: فزده من عمري أربعين سنة فلما قضى الله عُمر آدم جاءه ملك الموت فقال: قد بقي من عمري أربعون سنة قال: أولم تعطها ابنك داود؟ قَالَ رَسُول اللهِ صَلَّى اللَّهُ عَلَيه وَسَلَّم فجحد آدم فجحدت ذريته ونسى فنسيت ذريته وخطىء فخطئت ذريته.
Arabic;

    $expectedText = <<<Arabic
٨٨٩٢ - حدثنا أحمد بن إسحاق ، قال : حدثنا خلاد بن يحيى ، قال : حدثنا هشام بن سعد ، عن زيد بن أسلم ، عن أبي صالح ، عن أبي هريرة ، قال : قال رسول الله صلى الله عليه وسلم : لما خلق الله آدم مسح ظهره فسقط من ظهره كل نسمة هو خالقها إلى يوم القيامة ، ثم جعل عمر لكل إنسان منهم فقال آدم : من هؤلاء ؟، أحسبه قال : بنوك قال ، وإذا رجل منهم له نور بين عينيه فقال آدم : من هذا ؟ قال : هذا رجل من ذريتك فى آخر الأمم يقال له داود قال : وكم جعلت عمره ؟ قال : ستون سنة قال : فزده من عمري أربعين سنة فلما قضى الله عمر آدم جاءه ملك الموت فقال : قد بقي من عمري أربعون سنة قال : أولم تعطها ابنك داود ؟ قال رسول الله صلى الله عليه وسلم فجحد آدم فجحدت ذريته ونسى فنسيت ذريته وخطىء فخطئت ذريته .
Arabic;

    $text = ArabicFilter::withoutHarakat($arabic);

    expect(substr($text, 0, -1))->toBe($expectedText);

    CraftyPackage::setConfiguration('arabicable.spacing_after_punctuation_only', true);

    $expectedText = <<<Arabic
٨٨٩٢ - حدثنا أحمد بن إسحاق، قال: حدثنا خلاد بن يحيى، قال: حدثنا هشام بن سعد، عن زيد بن أسلم، عن أبي صالح، عن أبي هريرة، قال: قال رسول الله صلى الله عليه وسلم: لما خلق الله آدم مسح ظهره فسقط من ظهره كل نسمة هو خالقها إلى يوم القيامة، ثم جعل عمر لكل إنسان منهم فقال آدم: من هؤلاء؟، أحسبه قال: بنوك قال، وإذا رجل منهم له نور بين عينيه فقال آدم: من هذا؟ قال: هذا رجل من ذريتك فى آخر الأمم يقال له داود قال: وكم جعلت عمره؟ قال: ستون سنة قال: فزده من عمري أربعين سنة فلما قضى الله عمر آدم جاءه ملك الموت فقال: قد بقي من عمري أربعون سنة قال: أولم تعطها ابنك داود؟ قال رسول الله صلى الله عليه وسلم فجحد آدم فجحدت ذريته ونسى فنسيت ذريته وخطىء فخطئت ذريته.
Arabic;

    $text = ArabicFilter::withoutHarakat($arabic);

    expect(substr($text, 0, -1))->toBe($expectedText);
});



it('can format the Arabic text into a suitable one for search', function () {
    CraftyPackage::setConfiguration('arabicable.spacing_after_punctuation_only', false);

    $arabic = <<<Arabic
يجتَمعُ المؤمنونَ يومَ القيامةِ فيُلهَمونَ بذلِكَ فيقولونَ لوِ استَشفَعنا علَى ربِّنا عزَّوجلَّ فيُريحَنا مِن مقامِنا هذا فيأتونَ آدمَ فيقولونَ أنتَ أبونا خلقَك اللَّهُ بيدِه وأسجدَ لَك ملائِكتَه وعلَّمَك أسماءَ كلِّ شيءٍ فاشفَع لنا إلى ربِّكَ حتَّى يريحَنا مِن مقامِنا هذا فيقولُ لَستُ هناكُم ويذكرُ خطيئتَهُ الَّتي أصابَ :أكلَهُ الشَّجَرةَ وقد نهاه اللهُ عنها ولَكنِ ائتوا نوحًا فإنَّهُ أوَّلُ نَبيٍّ أرسلَهُ اللَّهُ تبارَكَ وتعالى فيأتونَ نوحًا فيقولُ لستُ هناكُم ويذكرُ خطيئتَهُ الَّتي أصابَ بسؤالٍ بغيرِ علمٌ ولَكنِ ائتوا إبراهيمَ خليلَ الرَّحمنِ فيقولُ لَستُ هناكُم ويذكرُ خطيئتَهُ الَّتي أصابَ قولَه: إِنِّي سَقِيمٌ وقولَه: بَلْ فَعَلَه كَبِيرُهُمْ هَذَا وقولَه حينَ أتى الملِكَ لامرأتِه قولي إنِّي أخوكِ فإنِّي أخبرُه أنَّكِ أُختي ولَكنِ ائتوا موسَى عَبدًا أعطاهُ اللَّهُ التَّوراةَ وكلَّمهُ فيأتونَ موسَى فيقولُ لَستُ هناكُم ويذكرُ خطيئتَهُ الَّتي أصابَ قتْلَه الرَّجلَ ولَكنِ ائتوا عيسَى عبدَ اللَّهِ ورسولَه و كلِمةَ اللهِ و روحَهُ فيأتونَ عيسَى فيقولُ : لستُ هناكُم ولَكنِ ائتوا مُحمَّدًا عبدًا غفرَ اللَّهُ لَه ما تقدَّمَ من ذنبِه وما تأخَّرَ فيأتوني فأستَأذِنُ علَى ربِّي في دارِهِ فإذا رأيتُه وقَعتُ ساجدًا فيدَعُني ما شاءَ اللَّهُ أن يدعَني ثمَّ يقولُ: ارفَع محمَّدُ قُل تُسمَع و اشفع تُشفَّعْ و سَلْ تُعطَه فأرفَعُ رأسي فأحمدُه بثناءٍ وتحميدٍ يعلِّمُنيهِ فأشفعُ فيحدُّ لي حدًّا فأخرِجُهُم فأدخلُهمُ الجنَّةَ ثمَّ أستأذن علَى ربِّي في دارِهِ الثَّانيَةَ فإذا رأيتُهُ وقَعتُ ساجدًا فيدَعُني ما شاءَ اللَّهُ أن يدَعَني ثم يقولُ ارفَع رأسكَ محمَّدُ قُل تُسمَعْ و اشفَع تُشفَّعْ و سَل تُعطَه فأرفعُ رأسي فأحمدُه بثناءٍ وتحميدٍ يعلِّمُنيهِ ثمَّ أشفعُ فيَحدُّ لي حدًّا فأخرِجُهم فأدخِلُهمُ الجنَّةَ فأستأذِنُ علَى ربِّي في دارِهِ الثَّالثةَ فيؤذَنُ لي علَيهِ فإذا رأيتُهُ وقعتُ ساجدًا فيدَعُني ما شاءَ اللَّهُ أن يدَعَني ثمَّ يقولُ: ارفَع محمَّدُ اشفَع تُشفَّعْ و سَلْ تعطَه فأرفعُ رأسي فأحمدُه بثناءٍ وتحميدٍ يعلِّمُنيهِ ثمَّ أشفَعُ فيَحدُّ لي حدًّا فأخرِجُهم فأدخلُهمُ الجنَّةَ فما يَبقيَ في النَّارِ إلَّا مَن حبسَه القرآنُ أي وجبَ علَيهِ الخلودُ و هو المقامُ المحمودُ الَّذي و عدَهُ اللهُ تباركَ و تعالى عَسَى أَنْ يَبْعَثَكَ رَبُّكَ مَقَامًا مَحْمُودًا و ربَّما قال قتادةُ فأُخرِجُهُم من النَّارِ فأدخِلُهمُ الجنَّةَ
Arabic;

    $expectedText = <<<Arabic
يجتمع المءمنون يوم القيامة فيلهمون بذلك فيقولون لو استشفعنا علا ربنا عزوجل فيريحنا من مقامنا هذا فياتون ءدم فيقولون انت ابونا خلقك الله بيده واسجد لك ملاءكته وعلمك اسماء كل شيء فاشفع لنا الا ربك حتا يريحنا من مقامنا هذا فيقول لست هناكم ويذكر خطيءته التي اصاب اكله الشجرة وقد نهاه الله عنها ولكن اءتوا نوحا فانه اول نبي ارسله الله تبارك وتعالا فياتون نوحا فيقول لست هناكم ويذكر خطيءته التي اصاب بسءال بغير علم ولكن اءتوا ابراهيم خليل الرحمن فيقول لست هناكم ويذكر خطيءته التي اصاب قوله اني سقيم وقوله بل فعله كبيرهم هذا وقوله حين اتا الملك لامراته قولي اني اخوك فاني اخبره انك اختي ولكن اءتوا موسا عبدا اعطاه الله التوراة وكلمه فياتون موسا فيقول لست هناكم ويذكر خطيءته التي اصاب قتله الرجل ولكن اءتوا عيسا عبد الله ورسوله و كلمة الله و روحه فياتون عيسا فيقول لست هناكم ولكن اءتوا محمدا عبدا غفر الله له ما تقدم من ذنبه وما تاخر فياتوني فاستاذن علا ربي في داره فاذا رايته وقعت ساجدا فيدعني ما شاء الله ان يدعني ثم يقول ارفع محمد قل تسمع و اشفع تشفع و سل تعطه فارفع راسي فاحمده بثناء وتحميد يعلمنيه فاشفع فيحد لي حدا فاخرجهم فادخلهم الجنة ثم استاذن علا ربي في داره الثانية فاذا رايته وقعت ساجدا فيدعني ما شاء الله ان يدعني ثم يقول ارفع راسك محمد قل تسمع و اشفع تشفع و سل تعطه فارفع راسي فاحمده بثناء وتحميد يعلمنيه ثم اشفع فيحد لي حدا فاخرجهم فادخلهم الجنة فاستاذن علا ربي في داره الثالثة فيءذن لي عليه فاذا رايته وقعت ساجدا فيدعني ما شاء الله ان يدعني ثم يقول ارفع محمد اشفع تشفع و سل تعطه فارفع راسي فاحمده بثناء وتحميد يعلمنيه ثم اشفع فيحد لي حدا فاخرجهم فادخلهم الجنة فما يبقي في النار الا من حبسه القرءن اي وجب عليه الخلود و هو المقام المحمود الذي و عده الله تبارك و تعالا عسا ان يبعثك ربك مقاما محمودا و ربما قال قتادة فاخرجهم من النار فادخلهم الجنة
Arabic;

    $text = ArabicFilter::forSearch($arabic);

    expect($text)->toBe($expectedText);

    CraftyPackage::setConfiguration('arabicable.spacing_after_punctuation_only', true);

    $text = ArabicFilter::forSearch($arabic);

    expect($text)->toBe($expectedText);
});
